<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $products = [
            ['id' => 1, 'name' => 'টেংরা মাছ', 'created_at' => '2026-01-05 16:00:00', 'updated_at' => '2026-01-06 05:43:29'],
            ['id' => 2, 'name' => 'রুই মাছ', 'created_at' => '2026-01-05 16:01:58', 'updated_at' => '2026-01-05 16:01:58'],
            ['id' => 3, 'name' => 'সিল্ভার মাছ', 'created_at' => '2026-01-05 16:02:13', 'updated_at' => '2026-01-05 16:02:13'],
            ['id' => 4, 'name' => 'মিরকা মাছ', 'created_at' => '2026-01-05 16:02:30', 'updated_at' => '2026-01-05 16:02:30'],
            ['id' => 5, 'name' => 'তেলাপিয়া মাছ', 'created_at' => '2026-01-05 16:02:48', 'updated_at' => '2026-01-05 16:02:48'],
            ['id' => 6, 'name' => 'পুটি মাছ', 'created_at' => '2026-01-05 16:03:07', 'updated_at' => '2026-01-05 16:03:07'],
            ['id' => 7, 'name' => 'দেশী টেংরা', 'created_at' => '2026-01-05 16:03:40', 'updated_at' => '2026-01-05 16:03:40'],
            ['id' => 8, 'name' => 'গোলসা টেংড়া', 'created_at' => '2026-01-05 16:04:01', 'updated_at' => '2026-01-05 16:04:01'],
            ['id' => 9, 'name' => 'ব্লাড কার্প মাছ', 'created_at' => '2026-01-05 16:04:22', 'updated_at' => '2026-01-06 05:42:07'],
            ['id' => 14, 'name' => 'কাতলা মাছ', 'created_at' => '2026-01-05 16:05:09', 'updated_at' => '2026-01-05 16:05:09'],
            ['id' => 15, 'name' => 'জাপানী মাছ', 'created_at' => '2026-01-05 16:05:34', 'updated_at' => '2026-01-05 16:05:34'],
            ['id' => 16, 'name' => 'গুচি মাছ', 'created_at' => '2026-01-05 16:06:01', 'updated_at' => '2026-01-05 16:06:01'],
            ['id' => 17, 'name' => 'পাবদা মাছ', 'created_at' => '2026-01-05 16:06:23', 'updated_at' => '2026-01-05 16:06:23'],
            ['id' => 18, 'name' => 'পাঁচ মিশালী মাছ', 'created_at' => '2026-01-05 16:07:14', 'updated_at' => '2026-01-06 05:41:34'],
            ['id' => 19, 'name' => 'পুটি টেংরা মিশালী', 'created_at' => '2026-01-05 16:07:47', 'updated_at' => '2026-01-05 16:07:47'],
            ['id' => 20, 'name' => 'চিতল মাছ', 'created_at' => '2026-01-05 16:08:16', 'updated_at' => '2026-01-05 16:08:16'],
            ['id' => 21, 'name' => 'মোয়া মাছ', 'created_at' => '2026-01-05 16:09:26', 'updated_at' => '2026-01-05 16:09:26'],
            ['id' => 22, 'name' => 'শিং মাছ', 'created_at' => '2026-01-05 16:09:45', 'updated_at' => '2026-01-05 16:09:45'],
            ['id' => 23, 'name' => 'বোয়াল মাছ', 'created_at' => '2026-01-05 16:10:07', 'updated_at' => '2026-01-05 16:10:07'],
            ['id' => 24, 'name' => 'বিগহেড মাছ', 'created_at' => '2026-01-05 16:10:49', 'updated_at' => '2026-01-05 16:10:49'],
            ['id' => 25, 'name' => 'কৈ মাছ', 'created_at' => '2026-01-05 16:11:27', 'updated_at' => '2026-01-06 05:41:00'],
            ['id' => 26, 'name' => 'চিংড়ি মাছ', 'created_at' => '2026-01-05 16:12:03', 'updated_at' => '2026-01-05 16:12:03'],
            ['id' => 27, 'name' => 'শাটি মাছ', 'created_at' => '2026-01-05 16:12:17', 'updated_at' => '2026-01-05 16:12:17'],
            ['id' => 28, 'name' => 'শোল মাছ', 'created_at' => '2026-01-05 16:13:04', 'updated_at' => '2026-01-05 16:13:04'],
            ['id' => 29, 'name' => 'খলিশা মাছ', 'created_at' => '2026-01-05 16:14:10', 'updated_at' => '2026-01-05 16:14:10'],
            ['id' => 30, 'name' => 'মলা মাছ', 'created_at' => '2026-01-05 16:14:27', 'updated_at' => '2026-01-05 16:14:27'],
            ['id' => 31, 'name' => 'মাগুর মাছ', 'created_at' => '2026-01-05 16:15:08', 'updated_at' => '2026-01-05 16:15:08'],
            ['id' => 32, 'name' => 'কাকিলা মাছ', 'created_at' => '2026-01-05 16:15:25', 'updated_at' => '2026-01-05 16:15:25'],
            ['id' => 33, 'name' => 'বেলে মাছ', 'created_at' => '2026-01-05 16:15:38', 'updated_at' => '2026-01-05 16:15:38'],
            ['id' => 34, 'name' => 'চাপিলা মাছ', 'created_at' => '2026-01-05 16:16:03', 'updated_at' => '2026-01-05 16:16:03'],
            ['id' => 35, 'name' => 'গজার মাছ', 'created_at' => '2026-01-05 16:16:18', 'updated_at' => '2026-01-05 16:16:18'],
            ['id' => 36, 'name' => 'বাটা মাছ', 'created_at' => '2026-01-05 16:16:32', 'updated_at' => '2026-01-05 16:16:32'],
            ['id' => 37, 'name' => 'বাউশ মাছ', 'created_at' => '2026-01-05 16:16:51', 'updated_at' => '2026-01-05 16:16:51'],
            ['id' => 38, 'name' => 'ফাইসা মাছ', 'created_at' => '2026-01-05 16:17:13', 'updated_at' => '2026-01-05 16:17:13'],
            ['id' => 39, 'name' => 'আইড় মাছ', 'created_at' => '2026-01-05 16:17:44', 'updated_at' => '2026-01-06 14:36:58'],
            ['id' => 40, 'name' => 'গ্লাস কার্প মাছ', 'created_at' => '2026-01-05 16:18:20', 'updated_at' => '2026-01-06 05:40:26'],
            ['id' => 41, 'name' => 'পাঙ্গাস মাছ', 'created_at' => '2026-01-05 16:18:54', 'updated_at' => '2026-01-05 16:18:54'],
        ];

        DB::table('products')->insert($products);
    }
}